Autodesk.Revit.DB.UnitSymbolType
Since:
2014
The unit symbol displayed in the formatted string representation of a number to indicate the units of the value.
Remarks:
Most unit symbols appear as suffixes after the formatted number,
for example "mm" for millimeters.  Some currency symbols appear as
prefixes, for example "$" for dollars.
Since:
2014